---
title: ExportFontTable
classe: Autodesk.Revit.DB.ExportFontTable
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# ExportFontTable

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `exportFontTable.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `exportFontTable.IsValidObject` | Boolean |
| `ExportFontInfo Item { get; set; }` | `exportFontTable.Item` | ExportFontInfo |
| `Void Add(ExportFontKey, ExportFontInfo)` | `exportFontTable.Add(exportFontKey, exportFontInfo)` | Void |
| `Void Clear()` | `exportFontTable.Clear()` | Void |
| `Boolean ContainsKey(ExportFontKey)` | `exportFontTable.ContainsKey(exportfontKey)` | Boolean |
| `Void Dispose()` | `exportFontTable.Dispose()` | Void |
| `IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>> GetEnumerator()` | `exportFontTable.GetEnumerator()` | IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>> |
| `ExportFontInfo GetExportFontInfo(ExportFontKey)` | `exportFontTable.GetExportFontInfo(exportFontKey)` | ExportFontInfo |
| `ExportFontTableIterator GetFontTableIterator()` | `exportFontTable.GetFontTableIterator()` | ExportFontTableIterator |
| `IList<ExportFontKey> GetKeys()` | `exportFontTable.GetKeys()` | IList<ExportFontKey> |
| `IList<ExportFontInfo> GetValues()` | `exportFontTable.GetValues()` | IList<ExportFontInfo> |
| `Void Remove(ExportFontKey)` | `exportFontTable.Remove(exportFontKey)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```